app/controllers/appointments_controller.rb

  def create
    slot = Slot.find_by_id(params['appointment']['slot_id'])
  	if slot.present?
      @appointment = current_user.appointments.new(appointment_params)
    	if !@appointment.save
---
SELECT  "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "appointments" ("slot_id", "patient_id", "appointment_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["slot_id", 1], ["patient_id", 21], ["appointment_date", "2021-02-01"], ["created_at", "2020-10-30 09:15:03.877640"], ["updated_at", "2020-10-30 09:15:03.877640"]]