app/controllers/password_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test_user1@gmail.com"], ["LIMIT", 1]]
---
  def forgot
    if params[:user][:email].blank? # check if email is present

SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "f77953abb56e2220"], ["LIMIT", 1]]
---
  def reset
    token = params[:user][:reset_password_token].to_s

    user = User.find_by(reset_password_token: token)