app/controllers/registrations_controller.rb

INSERT INTO "users" ("first_name", "middle_name", "last_name", "phone_number", "gender", "email", "encrypted_password", "confirmation_token", "confirmation_sent_at", "created_at", "updated_at", "user_type", "type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    if params[:user][:user_type] == "Doctor"
      doctor = Doctor.create(user_params)