app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: sign_in_params[:email])

    if user && user.valid_password?(sign_in_params[:password])
      user.update(device_token: params[:user][:device_token])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test_user1@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "device_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["device_token", "ERs232312sadfa2322"], ["updated_at", "2020-03-29 08:48:29.024294"], ["id", 1]]

  def destroy
    if params[:user][:user_id]
      user = User.find params[:user][:user_id]
      if user.present?
        reset_session
        user.update({device_token: nil})
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "device_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-03-29 09:20:12.722988"], ["device_token", nil], ["id", 1]]