app/controllers/slots_controller.rb

  def create
  	@slot = current_user.slots.new(slot_params)
  	if !@slot.save
---
INSERT INTO "slots" ("start_time", "end_time", "doctor_id", "slot_type", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"